---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchTooLarge
source: html/470b0289-c34d-0b35-2e9e-a3df52944f53.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.SketchTooLarge Property

Sketch is too large.

## Syntax (C#)
```csharp
public static FailureDefinitionId SketchTooLarge { get; }
```